{
  "user": [
    {
      "name": "Bruno Duarte",
      "description": "Tristique volutpat pulvinar vel massa, pellentesque egestas. Eu viverra massa quam dignissim aenean malesuada suscipit. Nunc, volutpat pulvinar vel mass",
      "github": "brunosduarte",
      "workingPlace": "Engenhação",
      "followers": 33
    }
  ],
  "repositories": [
    {
      "id": 1,
      "title": "JavaScript data types and data structures",
      "publisher": "brunosduarte",
      "content": "Programming languages all have built-in data structures, but these often differ from one language to another. This article attempts to list the built-in data structures avaiable in...",
      "createdAt": "2024-07-27T13:38:57.560Z",
      "comments": 10
    },
    {
      "id": 2,
      "title": "React Projects and State management",
      "publisher": "brunosduarte",
      "content": "The core function of every application is its ability to manage, store, and manipulate data created within it or received from an external source. This data can be in the form of variables...",
      "createdAt": "2024-07-28T13:38:57.560Z",
      "comments": 3
    },
    {
      "id": 3,
      "title": "Stop using useQuery from React-Query",
      "publisher": "brunosduarte",
      "content": "Using Suspense and useSuspenseQuery revolutionizes the management of loading states in React applications. This approach not only simplifies the code but also enhances the user experience by ... ",
      "createdAt": "2024-07-29T13:38:57.560Z",
      "comments": 5
    },
    {
      "id": 4,
      "title": "useLayoutEffect vs. useEffect in React",
      "publisher": "brunosduarte",
      "content": "The useLayoutEffect and useEffect hooks in React share similarities in function but differ when it comes to execution timing. In this article, we’ll delve into this main difference, providing insights...",
      "createdAt": "2024-07-30T13:38:57.560Z",
      "comments": 8
    },
    {
      "id": 5,
      "title": "Use TypeScript generators for cleaner programming",
      "publisher": "brunosduarte",
      "content": "Generators help fetch and process data from APIs more granular, improving code modularity and user-friendliness. This tutorial teaches you how to use TypeScript generators for cleaner programming using a...",
      "createdAt": "2024-07-31T13:38:57.560Z",
      "comments": 20
    },
    {
      "id": 6,
      "title": "Inline ref functions in React",
      "publisher": "brunosduarte",
      "content": "Inline ref functions are defined directly within the JSX of a component. When you use an inline function for a ref, React calls this function twice during renders: first with null to clear the previous ref...",
      "createdAt": "2024-08-01T13:38:57.560Z",
      "comments": 30
    },
    {
      "id": 7,
      "title": "React useRef hook: Not Just for HTML Elements",
      "publisher": "brunosduarte",
      "content": "The useRef hook creates a reference object that holds a mutable value, stored in its current property. This value can be anything from a DOM element to a plain object. Unlike component state via say the useState...",
      "createdAt": "2024-08-02T13:38:57.560Z",
      "comments": 15
    }
  ]
}